In [1]:
-- connection: postgres://postgres:1234@localhost:5433/pec4

In [9]:
CREATE TABLE teoria.historico(
    id_empleado SERIAL PRIMARY KEY,
    fecha_alta DATE, 
    nombre VARCHAR(30),
    puesto VARCHAR(30),
    salario_anual INTEGER
);

INSERT INTO teoria.historico (fecha_alta, nombre, puesto, salario_anuaL)
VALUES('2015-01-01','Manuel Vázquez','Ingeniero de Software','23500'),
      ('2015-01-02','Elena Rodríguez','Analista de Sistemas','16000'),
      ('2015-01-03','José Pérez','Programador SQL','17000'),
      ('2015-03-01','Manuel Vázquez','Jefe de Proyectos','25500'),
      ('2015-10-01','Manuel Vázquez','Jefe de Proyectos Sénior','26500'),
      ('2015-06-15','José Pérez','Programador SQL Sénior','19000'),
      ('2015-04-01','Fernando Nadal','Becario','13000'),
      ('2015-10-01','Elena Rodríguez','Responsable Analistas','24500'),
      ('2015-01-01','Víctor Anllada','Jefe Departamento','28000');

In [11]:
SELECT * FROM teoria.historico;

9 row(s) returned.

  id_empleado  fecha_alta    nombre           puesto                      salario_anual
-------------  ------------  ---------------  ------------------------  ---------------
            1  2015-01-01    Manuel Vázquez   Ingeniero de Software               23500
            2  2015-01-02    Elena Rodríguez  Analista de Sistemas                16000
            3  2015-01-03    José Pérez       Programador SQL                     17000
            4  2015-03-01    Manuel Vázquez   Jefe de Proyectos                   25500
            5  2015-10-01    Manuel Vázquez   Jefe de Proyectos Sénior            26500
            6  2015-06-15    José Pérez       Programador SQL Sénior              19000
            7  2015-04-01    Fernando Nadal   Becario                             13000
            8  2015-10-01    Elena Rodríguez  Responsable Analistas               24500
            9  2015-01-01    Víctor Anllada   Jefe Departamento                   28000

2) Generad, mediante el uso de CTE, la consulta SQL necesaria para obtener 
>* el nombre de empleados existentes a día 1 Septiembre 2015, 
>* su puesto y salario en dicho día, 
>* el puesto y salario actual, 
>* y la diferencia entre el salario actual y el salario a día 1 Septiembre 2015.

In [24]:
WITH empleados_sep2015 AS(
        SELECT
            id_empleado,
            MAX(fecha_alta) AS MaxFechaAlta
        FROM 
            teoria.historico
        WHERE 
            fecha_alta <= '2015-09-01'
        GROUP BY id_empleado
    ), empleado_actuale AS(
        SELECT
            id_empleado,
            MAX(fecha_alta) AS MaxFechaAlta
        FROM 
            teoria.historico
        WHERE 
            id_empleado IN(
                        SELECT e2015.id_empleado
                        FROM empleados_sep2015 e2015
            )
        GROUP BY id_empleado
    ), detalles_sep2015 AS(
        SELECT 
            historico.id_empleado,
            historico.nombre,
            historico.puesto,
            historico.salario_anual
        FROM teoria.historico
        INNER JOIN empleados_sep2015 e2015 ON
            e2015.id_empleado = historico.id_empleado
        AND e2015.MaxFechaAlta = historico.fecha_alta
    ), detalles_actual AS (
        SELECT 
            historico.id_empleado,
            historico.nombre,
            historico.puesto,
            historico.salario_anual
        FROM teoria.historico
        INNER JOIN empleado_actuale eActual ON
            eActual.id_empleado = historico.id_empleado
        AND eActual.MaxFechaAlta = historico.fecha_alta
    )
SELECT
    dSep2015.nombre,
    dSep2015.puesto PuestoSep2015,
    dSep2015.salario_anual SalarioSep2015,
    dActual.puesto PuestoActual,
    dActual.salario_anual SalarioActual,
    dActual.salario_anual - dSep2015.salario_anual Diferencia
FROM
    detalles_sep2015 dSep2015
        INNER JOIN detalles_actual dActual ON
            dSep2015.id_empleado = dActual.id_empleado;

7 row(s) returned.

nombre           puestosep2015             salariosep2015  puestoactual              salarioactual    diferencia
---------------  ----------------------  ----------------  ----------------------  ---------------  ------------
Víctor Anllada   Jefe Departamento                  28000  Jefe Departamento                 28000             0
José Pérez       Programador SQL                    17000  Programador SQL                   17000             0
Manuel Vázquez   Jefe de Proyectos                  25500  Jefe de Proyectos                 25500             0
José Pérez       Programador SQL Sénior             19000  Programador SQL Sénior            19000             0
Elena Rodríguez  Analista de Sistemas               16000  Analista de Sistemas              16000             0
Fernando Nadal   Becario                            13000  Becario                           13000             0
Manuel Vázquez   Ingeniero de Software              23500  Ingeniero de Software             23500             0

3. Utilizando la tabla de Histórico de puestos de empleados del ejercicio 2, obtened la misma información propuesta en dicho ejercicio, añadiendo al resultado 
>* el ranking de estos empleados sobre la base del salario anual en la fecha especificada, 
>* el ranking sobre la base del salario anual a día de hoy, 
>
>y para cada empleado, 
>* la media de salario en Septiembre y actual para el conjunto de empleados activos en Septiembre 2015.

In [26]:
WITH empleados_sep2015 AS(
        SELECT
            id_empleado,
            MAX(fecha_alta) AS MaxFechaAlta
        FROM 
            teoria.historico
        WHERE 
            fecha_alta <= '2015-09-01'
        GROUP BY id_empleado
    ), empleado_actuale AS(
        SELECT
            id_empleado,
            MAX(fecha_alta) AS MaxFechaAlta
        FROM 
            teoria.historico
        WHERE 
            id_empleado IN(
                        SELECT e2015.id_empleado
                        FROM empleados_sep2015 e2015
            )
        GROUP BY id_empleado
    ), detalles_sep2015 AS(
        SELECT 
            historico.id_empleado,
            historico.nombre,
            historico.puesto,
            historico.salario_anual
        FROM teoria.historico
        INNER JOIN empleados_sep2015 e2015 ON
            e2015.id_empleado = historico.id_empleado
        AND e2015.MaxFechaAlta = historico.fecha_alta
    ), detalles_actual AS (
        SELECT 
            historico.id_empleado,
            historico.nombre,
            historico.puesto,
            historico.salario_anual
        FROM teoria.historico
        INNER JOIN empleado_actuale eActual ON
            eActual.id_empleado = historico.id_empleado
        AND eActual.MaxFechaAlta = historico.fecha_alta
    )
SELECT
    dSep2015.nombre,
    dSep2015.puesto PuestoSep2015,
    dSep2015.salario_anual SalarioSep2015,
    dActual.puesto PuestoActual,
    dActual.salario_anual SalarioActual,
    dActual.salario_anual - dSep2015.salario_anual Diferencia,
    RANK() OVER (ORDER BY dSep2015.salario_anual DESC) AS rk_salarioSep2015,
    RANK() OVER (ORDER BY dActual.salario_anual DESC) AS rk_salarioActual2015,
    AVG(dSep2015.salario_anual) OVER () mediaSalarialActual
FROM
    detalles_sep2015 dSep2015
        INNER JOIN detalles_actual dActual ON
            dSep2015.id_empleado = dActual.id_empleado;

7 row(s) returned.

nombre           puestosep2015             salariosep2015  puestoactual              salarioactual    diferencia    rk_salariosep2015    rk_salarioactual2015    mediasalarialactual
---------------  ----------------------  ----------------  ----------------------  ---------------  ------------  -------------------  ----------------------  ---------------------
Víctor Anllada   Jefe Departamento                  28000  Jefe Departamento                 28000             0                    1                       1                20285.7
Manuel Vázquez   Jefe de Proyectos                  25500  Jefe de Proyectos                 25500             0                    2                       2                20285.7
Manuel Vázquez   Ingeniero de Software              23500  Ingeniero de Software             23500             0                    3                       3                20285.7
José Pérez       Programador SQL Sénior             19000  Programador SQL Sénior            19000             0                    4                       4                20285.7
José Pérez       Programador SQL                    17000  Programador SQL                   17000             0                    5                       5                20285.7
Elena Rodríguez  Analista de Sistemas               16000  Analista de Sistemas              16000             0                    6                       6                20285.7
Fernando Nadal   Becario                            13000  Becario                           13000             0                    7                       7                20285.7

4. Supongamos que hemos diseñado una dimensión Producto con las siguientes columnas: 
>* id producto (clave subrogada, tipo entero), 
>* código producto (tipo alfanumérico), 
>* nombre producto (tipo alfanumérico), 
>* categoría producto (tipo alfanumérico), 
>* fecha de alta (tipo fecha), 
>* fecha de baja (tipo fecha). 
>
>Suponed que las fechas de alta y baja se utilizan para gestionar el histórico de productos.  
Proporcionad el resultado final de realizar las siguientes operaciones, asumiendo que:
>
>* La dimensión está vacía en el momento de comenzar el ejercicio.  
>* La secuencia utilizada para generar la clave subrogada comienza con un valor 1 y se incrementa en 1.  
>* Todas las filas de la dimensión tienen que tener valores para todas las columnas (no sepueden insertar valores nulos).

In [28]:
CREATE TABLE pregunta4(
    
)

syntax error at end of input
LINE 1: CREATE TABLE
                     ^